Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: The goal of the dependency checker is to flag problematic code combinations at the dynamic and static link level, specific to C and C++ programming languages.
ja: 依存関係解析ツールの目的は、CやC++言語に特有の話題ですが、動的リンク、静的リンクのレベルで問題のあるコードの組み合わせにフラグを付けることです。

source: The goal of these seminars is to present and elicit discussions about the various aspects of incorporating open source in products or software stacks.
ja: これらのセミナーの目標は、製品やソフトウェア スタックに統合されているオープン ソースの様々な面に関して説明して議論を引き出すことです。

source: The goal of these seminars is to present and evoke discussions of the various aspects of incorporating open source in a commercial product or an enterprise software portfolio.
ja: こうしたセミナーの目標は、商用の製品や企業のソフトウェア ポートフォリオの中にオープンソースを組み込むことの様々な側面について講演し、議論を起こすことです。

source: The goal of this initial step is to monitor the ingress and incorporation of open source in a software portfolio, either as a standalone package or embedded within third-party or company-developed software.
ja: この最初のステップの目的は、標準パッケージや、サード パーティか自社開発ソフトウェアに組み込まれた形で、オープン ソースがソフトウェア ポートフォリオに入り込んだり統合されたりすることを監視することです。

source: The goal of this review is to ensure that architectural guidelines are respected and that the interactions among open source, proprietary, and third-party software are within the acceptable legal guidelines.
ja: 本レビューの目的は、アーキテクチャのガイドラインが尊重され、オープンソース、プロプラエタリ、サードパーティのソフトウェアの関係が、現場が受け入れ可能な法的ガイドラインの範囲内に収まっていることを確認することです。

source: The goal of this review is to identify:
ja: このレビューの目的は、特定することです。

source: The goal with this step is to ensure that the open source package you are about to distribute compiles on a vanilla, end-user system.
ja: このステップの目的は、頒布しようとしているオープン ソース パッケージが、平凡なエンド ユーザー システム上でコンパイルできることを確実にすることです。

source: The goals of the audit are to:
ja: 監査の目的は：

source: The goals of the pre-distribution verification are to ensure that:
ja: 頒布前検証の目的は、以下を確実にすることです：

source: The goals of the source code distribution process and policy are to ensure that:
ja: ソース コード頒布プロセスとポリシーの目的は、以下を確実にすることです。

source: The important takeaway from the notices considerations is to ensure that all open source notice requirements are satisfied prior to a product distribution or service launch.
ja: 通知に関する考察から得られる重要なことは、製品出荷やサービス開始前に、全てのオープン ソース通知に対する要求が満たされることを、確実にしなければならないということです。

source: The incoming and outgoing licenses are in the plural form because in some cases, a software component can include source code available under different licenses.
ja: ソフトウェア コンポーネントは、異なるライセンスによって許諾されるソース コードを含むことがあるので、入るライセンスと出るライセンスは、複数のフォーム入ることがあります。

source: The incoming license is the license under which you received the software package.
ja: 入るライセンスは、受け取ったソフトウェア パッケージに対するライセンスです。

source: The incoming licenses are the licenses of all source code included in a given body of code; the outgoing licenses are the licenses under which the source code and/or object files are being made available to its recipients.
ja: 入ってくるライセンスとは、対象となるコードに含まれるソースコード全てのライセンスのこと です。出ていくライセンスとは、製品やサービスの 受領者が利用できるソースコードやオブジェクト ファイルのライセンスのことです。

source: The individual package owner within the organization usually performs this specific task.
ja: 個々のパッケージの組織内でのオーナーが通常はこの仕事を行います。

source: The input to the scan phase is the OSRB usage form that an engineer has filled out online and submitted.
ja: スキャン フェーズへのインプットは、技術者がオンラインで記入して提出するOSRB利用フォームとなります。

source: The input to this phase is the complete compliance record of the software component, which includes the following:
ja: このフェーズへのインプットは、ソフトウェア コンポーネントに関する全てのコンプライアンス記録です。それには以下が含まれます。

source: The input to this phase is the report generated by the scanning tool in the previous phase.
ja: このフェーズへのインプットは、前フェーズでスキャン ツールによって生成された報告書になります。

source: The inputs to a BOM difference tool are two BOM files that represent the list of components available on two different versions of a product or service code base.
ja: BOM差分ツールへの入力は、製品やサービスのコード ベースの二つのバージョンのコンポーネント リストを示す二つのBOMファイルです。

source: The inquiry response strategy establishes what must be done when the company’s compliance efforts are challenged.
ja: 照会応答戦略は、コンプライアンスが問われた時に行うべきことを定めます。

source: The intellectual property failures can lead to one or more of the following results:
ja: 知財上の失敗は下記を招く。

source: The internal package owner, the OSRB engineering representative, and the Compliance Officer usually perform the architecture review.
ja: 企業内のパッケージ オーナー、OSRB技術代表とコンプライアンス オフィサーが、通常アーキテクチャー レビューを実施します。

source: The internal package owner, the OSRB engineering representative, and the open source expert usually perform the architecture review.
ja: 社内パッケージ所有者、OSRB技術代表、そしてオープン ソース エキスパートが、アーキテクチャ レビューを行います。

source: The internal portal hosts compliance policies, guidelines, training material, announcements, and access to related mailing lists.
ja: 社内向けポータルは、コンプライアンス ポリシーやガイドライン、トレーニング教材、通知、関連するメーリング リストなどを提供しています。

source: The internal portal hosts the compliance policies, guidelines, documents, training, announcements, and access to mailing lists.
ja: 内部向けのポータルはコンプライアンスポリシー、ガイドライン、各種文書、訓練、通知、メーリングリストへのアクセスを提供します。

source: The key is thoughtful and realistic planning.
ja: カギとなるのは思慮深く現実的な計画です。

source: The last step of the process is including the final text in the product documentation.
ja: 最後に、最終稿 を製品添付の文書に含めます。

source: The license of the open source component in question may require including copyright notices in the product document available to the end user.
ja: 問題となっているオープン ソース コンポーネントのライセンスは、エンド ユーザーが利用可能な製品文書中に著作権表記を必要とするかもしれません。

source: The license of the open source component in question must be included in the user documentation for all products using this open source.
ja: 問題となっているオープン ソース コンポーネントのライセンスは、このオープン ソースを利用する全ての製品のユーザー文書に含まれていなければなりません。

source: The license on a software component may have changed between versions.
ja: ソフトウェア コンポーネントのライセンスが、バージョンの間で変更されているかもしれません。

source: The license, copyright, and attribution notices for a specific component are prepared and passed along to the appropriate departments to be included in the product documentation.
ja: 対象のコンポーネントのライセンス、著作権、および帰属通知が準備され、製品の資料に含めるべく担当部署に手渡される。

source: The licensing agreement for software components received from a third-party software provider
ja: サード パーティ ソフトウェア プロバイダから受け取るソフトウェア コンポーネントに対するライセンス契約

source: The list of discovered issues, information on how they were resolved, and who verified that these issues were successfully resolved
ja: 発見された課題、課題が解決された経緯に関する情報、課題が解決されたことを確認した人のリスト

source: The list of discovered issues, information on how they were resolved, and who verified that these issues were successfully resolved .
ja: 発見された課題、課題が解決された経緯に関する情報、課題が解決されたことを確認した人

source: The localization team is responsible for translating basic language that informs users of the availability of open source software in the product and directs them to the proper notices made available in English.
ja: ローカル化チームは製品に含まれるオープンソース ソフトウェアの入手についてユーザーに知らせ、英語での適切な通告が利用可能となる ようにします。

source: The main requirements for dependency mapping are the abilities to:
ja: 依存関係マッピングに対する主な要求事項は、以下の機能です。

source: The most important outcome of non-compliance cases has been that the companies involved ultimately had to comply with the terms of the license(s) in question, and the costs of addressing the problem after the fact has categorically exceeded those of basic compliance.
ja: コンプライアンス違反事件の最も重要な教訓は、関係した企業は最終的には問題のライセンス条項に従わなければならなかった、のであり、この事実を踏まえた問題解決のコストは基本的なコンプライアンスのコストを圧倒的に上回っていた、のです。

source: The most successful way to establish compliance is to incorporate the compliance process and policies, checkpoints and activities as part of existing software development processes.
ja: コンプライアンス確立の最善の方法は、コンプライアンス プロセスやポリシー、チェックポイント、活動を既存のソフトウェア開発プロセスに組み込むことです。

source: The name of the affected product(s) or service(s) or the exact code of concern .
ja: 影響のある製品やサービスや、該当するコードの名前

source: The name of the project code and license that may have been violated .
ja: プロジェクト コードと違反状態にあるライセンスの名前

source: The next step in the compliance due diligence is to decide on the method and mode of distribution, type of packages to distribute, and mechanism of distribution.
ja: コンプライアンス精査の次のステップは、頒布の方法とモード、頒布するパッケージのタイプ、および頒布メカニズムを決定することです。

source: The next time this component is going to be used, it must re-enter the compliance process and progress as approved before it is integrated in the product or service source code repository.
ja: 当該コンポーネントが次に利用される場合には、そのコンポーネントが製品に組み込まれるか、ソース コード リポジトリに入る前に、コンプライアンス プロセスに再入力して承認を得なければなりません。

source: The obvious question is “How can I keep track of all of these changes?”
ja: あるべき質問は、「どうすれば全ての変更を追跡できるだろうか？」というものです。

source: The open source compliance policy is a set of rules that govern the management of open source software (both use of and contribution to).
ja: オープンソース コンプライアンス ポリシーとは、オープンソース ソフトウェアの管理（利用と寄付の双方）を取り仕切るルール群です。

source: The open source compliance strategy drives the business-based consensus on the main aspects of the policy and process implementation.
ja: オープンソース コンプライアンス戦略は、ポリシーやプロセスの実装 の主たる側面について、ビジネスに立脚してコンセンサスを推し進めるものです。

source: The open source compliance team is a cross-disciplinary group consisting of various individuals tasked with the mission of ensuring open source compliance.
ja: オープンソース コンプライアンス チームとは、オープンソース コンプライアンスを確実に行うため様々な分野の人々を集めたチームです。

source: The open source development model encourages frequent releases, starting on project day one, to give users opportunities to experiment and report bugs.
ja: オープン ソース開発モデルは、プロジェクト初日に始める頻繁なリリースを推奨しています。これによってユーザーに評価実験や不具合報告の機会を与えます。

source: The open source package has been approved by OSRB for usage that corresponds to what was declared in the usage form.
ja: オープン ソース パッケージは、利用フォームで宣言された範囲で、その利用をOSRBによって承認されています。

source: The outgoing license is the license under which you are licensing the software package.
ja: 出るライセンスは、使用許諾するソフトウェア パッケージに対するライセンスです。

source: The output from the scan phase is a report produced by the source code scanning tool that provides information on:
ja: スキャン フェーズのアウトプットは、ソース コード スキャン ツールによって生成される報告です。これには、次のような情報が書かれます。

source: The output of the BOM difference checker documents the list of new components, retired components, and modified components.
ja: BOM差分ツールの出力は、新しいコンポーネント、使わなくなったコンポーネント、および変更されたコンポーネントのリストです。

source: The output of this phase is a decision to either approve or deny the usage of the software component.
ja: このフェーズのアウトプットは、ソフトウェア コンポーネントの利用に関する、承認または却下の判断です。

source: The output of this phase is a legal opinion of compliance, and a decision on the incoming and outgoing license(s) for the software component in question.
ja: このフェーズのアウトプットは、コンプライアンスに関する法務の意見、問題となっているソフトウェア コンポーネントについての入るライセンスと出るライセンスに対する決定となりま

source: The priority for all organizations is to ship products and services on time while building and expanding their internal open source compliance infrastructure.
ja: すべての組織において優先されるのは、製品やサービスを期限通りに出荷し、と同時に内部的なオープンソース コンプライアンスのインフラストラクチャー を構築し拡大することです。

source: The process starts by identifying the various software components integrated into the product’s build system, and ends by compiling a list of resulting license obligations.
ja: プロセスは、製品ビルド システムへ統合する様々なソフトウェア コンポーネントを特定することで始まり、結果として発生するライセンス義務をリスト化することで終わります。

source: The process starts with the compliance officer, who prepares the draft of the written offer and the notices that are to be made available once the product ships.
ja: このプロセスはコンプライアンス オフィサーが開始します。コンプライアンス オフィサーは製品が出荷されたら利用可能となる告知の書面や通告の草案を準備します。

source: The product containing the open source packages is ready to ship or has shipped already.
ja: オープン ソース パッケージを含む製品は、出荷可能か、すでに出荷されています。

source: The reason why a violation is believed to exist
ja: 違反があると信じる理由

source: The reason why a violation is believed to exist .
ja: 違反があると信じる理由

source: The reasons varied from product to product, but the common theme across industries was that open source components provided compelling features out of the box, there were meaningful economies to be gained through distributed development that resulted in a faster time-to-market, and they offered a newfound ability to customize the source code.
ja: その理由は製品ごとに様々ですが、様々な業界で共通するのは、オープンソースのコンポーネントには即座に使える卓越した特徴があったこと、分散的な開発による市場投入への時間短縮により経済的に有意の利益があったこと、そしてソースコードをカスタマイズするという新しく出来ることを提供したこと、です。その結果、複数のソースによる新たな開発モデルが登場しました。

source: The recommended practices map directly to the steps illustrated in the compliance process shown in Figure 24 (next page).
ja: 推奨プラクティスは、図24（次ページ）に示したコンプライアンス プロセスの中のステップに直接配置されます。

source: The remainder of this chapter will address each of these ten steps in detail.
ja: この章の残りの部分では、これらの10ステップについて詳しく説明します。

source: The report flags issues such as conflicting and incompatible licenses.
ja: この報告書は、矛盾を起こしているライセンスや両立しないライセンスのような課題にフラグを付けています。

source: The report has flagged source code files that were not identified, or possible license conflicts resulting from mixing source code coming in under different licenses.
ja: 報告は、特定されていないソース コード ファイルや、異なるライセンスで結合されるソース コードによって生じるライセンス矛盾にフラグを付けます。

source: The result of compliance due diligence is identification of all free and open source software used in a product intended for external distribution, and a plan to meet the attendant license obligations.
ja: コンプライアンス精査の結果は、外部出荷を意図した製品において使われる全てのフリー オープン ソース ソフトウェアの特定と、それに付随するライセンス義務を遵守するための計画です。

source: The result of such combination is a licensing chimera, an aggregation of software components that for purely legalistic reasons cannot be redistributed.
ja: そのような結合は、純粋に法的な理由から再頒布できないようなソフトウェア コンポーネントの集合、つまり、ライセンス キメラを作り出します。

source: The result of the architecture review is an analysis of the licensing obligations that may extend from open source to proprietary or third-party components.
ja: アーキテクチャー レビューの結果は、オープン ソースからプロプライエタリ コンポーネントやサード パーティ コンポーネントへ影響するかもしれないライセンス義務の分析です。

source: The result of the architecture review is an analysis of the licensing obligations that may extend from open source to proprietary or third-party software components (and across open source components as well).
ja: アーキテクチャー レビューの結果は、オープン ソースからプロプライエタリやサード パーティ ソフトウェア コンポーネントへ（同様にオープン ソース コンポーネント間で）影響を与えるようなライセンス義務の分析となります。

source: The result of the architecture review is an analysis of the licensing obligations that may extend from the open source components to the proprietary components (and vice versa).
ja: アーキテクチャー レビューの結果は、オープン ソース コンポーネントからプロプライエタリ コンポーネントへ（その逆も）影響を与えるライセンス義務の解析です。

source: The result of the architecture review is an analysis of the licensing obligations that may extend from the open source components to the proprietary components.
ja: アーキテクチャー レビューの結果は、オープン ソース コンポーネントがプロプライエタリ コンポーネントへ影響を与えるかもしれないライセンス義務の分析です。

source: The reviewers need to understand the licenses that govern use, modification, and distribution of the software, and identify the obligations of the various licenses.
ja: レビュアーは、ソフトウェアの利用、変更、頒布を支配するライセンスを理解し、様々なライセンスの義務を特定する必要があります。

source: The role of the documentation team in updating the product documentation, reflecting the presence of open source in the product
ja: 製品添付の文書を更新し製品に含まれるオープンソースの存在を反映する文書化チームの役割

source: The scanned software component contains 100% proprietary code, and no open source code is declared or identified.
ja: スキャンされたソフトウェア コンポーネントは、100%プロプライエタリ コードだけを含んでいて、オープン ソース コードは申告も特定もされていない。

source: The scanned software component includes source code that originated from multiple sources with incompatible licenses.
ja: スキャンされたソフトウェア コンポーネントは、両立性のないライセンスが付けられた複数のソース コードに由来するソース コードを含んでいることがあります。

source: The scope and nature of an organization’s use of open source is dynamic .
ja: 組織がオープンソースを利用する範囲や目的 は変化します。

source: The second step in compliance due diligence consists of scanning the source code using automated analysis tools to discover matches with known open source projects.
ja: コンプライアンス精査の2番目のステップは、既知のオープン ソース プロジェクトとの一致を検出する自動解析ツールを使ったスキャンで構成されます。

source: The single most important recommendation with respect to messaging is to be clear and consistent, whether internally .
ja: 意思の伝達に関する最も重要で唯一の推奨事項は、社内にオープンソースに関連する企業目標や懸念事項を説明するか、社外のコミュニティ参加者に対するかに関わらず、明確で一貫性を持つことです。

source: The single most important recommendation with respect to messaging is to be clear and consistent, whether it is internally explaining the company’s goals and concerns around open source to your employees or externally toward the developer communities of the open source projects you use in your product/software stack.
ja: ここで最も重要なのは明確で首尾一貫していることで、内部的に従業員に対してオープンソース関連の会社の目標や懸念事項を伝える場合も、外部に向け自社製品やソフトウェア スタックが利用しているオープンソース プロジェクトの開発者コミュニティに伝える場合も同様です。

source: The software component has been approved for usage and registered in the software inventory.
ja: ソフトウェア コンポーネントについて、使用が承認され、ソフトウェア一覧表への登録が完了している。

source: The software component is no longer used.
ja: そのソフトウェア コンポーネントは、もはや使われない。

source: The source code audit report generated by the scanning tool
ja: スキャン ツールによって生成されたソース コード監査報告

source: The source code audit report generated by the scanning tool .
ja: スキャン ツールによって生成されたソース コード監査報告 .

source: The source code distributed is the correct version, corresponds to the binary version included in the product transmission of the software to the distribution site, and is labeled appropriately
ja: 頒布したソース コードは、頒布サイトに転送されるソフトウェアのバイナリ バージョンと照らし合わせて正しいバージョンであり、また、適切にラベル付けされている。

source: The source code is published on the website.
ja: ソース コードはウェブサイト上で公開される。

source: The source code of the component in question is uploaded to the website for distribution (if that is the distribution method of choice).
ja: 対象のコンポーネントのソース コードは、頒布用のウェブサイトにアップロードされる。（そういう頒布方法が選択された場合）

source: The strategy establishes what must be done to ensure compliance and offers a governing set of principles for how personnel interact with open source software.
ja: コンプライアンス戦略はコンプライアンスを確保するために行うべきことを定め、職員のオープンソース ソフトウェアの扱いを統べる原則を与えます。

source: The submitter provides information regarding the intended use of the open source package for review and approval.
ja: 申請者は、レビューと承認の対象であるオープン ソース パッケージの計画した利用に関して情報を提供します。

source: The subtasks should include a description of the issue, a proposed solution to be implemented by engineering, and a specific timeline for completion.
ja: サブタスクは、課題の説明、技術担当によって実施されるべき解決提案、そして完了までの具体的な日程を含んでいるべきです。

source: The sum of all of these documentation obligations is often referred to as open source notices.
ja: これらの文書化の義務の全体は、しばしばオープン ソース通知と呼ばれます。

source: The tables illustrate which licenses can dynamically or statically link to which others, while respecting company policies.
ja: この表は、どのライセンスが、企業ポリシーを考慮した上で、他のライセンスと動的静的にリンク可能であるかを示します。

source: The term due diligence refers to a number of concepts involving source code inspection, source code surveillance, or the performance of quality duties and system audits.
ja: 精査（due diligence）という用語は、ソース コード検査、ソース コード監視、品質義務やシステム監査の実行などを含む多くの概念を指しています。

source: The tool identifies a linkage conflict between the license of the binaries and the license of the libraries it links to, based on predefined license policies that the user of the tool has already defined.
ja: このツールは、ツールの使用者が事前に定義したライセンス ポリシーに基づいて、バイナリとライブラリのライセンス間のリンクの矛盾を特定します。

source: The usage policy is an essential building block in a compliance program.
ja: 利用ポリシーは、コンプライアンス プログラムの不可欠要素です。

source: The “scan early and often” approach has several advantages:
ja: 「早めに、そして頻繁にスキャン“scan early and often”」というアプローチには、いくつかの有利な点があります。

source: The “scan early and often” approach has several advantages: .
ja: 「早めに、そして頻繁にスキャン“scan early and often”」というアプローチには、いくつかの有利な点があります。

source: Their primary responsibility from a compliance perspective is to submit a usage form for any open source that is planned for inclusion in a product or service.
ja: コンプライアンスの観点からのチームの主な責任は、製品やサービスに含まれる予定の全オープンソースについて利用申請書類を出すことです。

source: Then the compliance officer forwards the compliance ticket to the representative from the Legal department for review and approval.
ja: コンプライアンス オフィサーは、レビューと承認を受けるために、コンプライアンス チケットを法務代表へ送ります。

source: There are different types of reviews that occur as part of a compliance process.
ja: コンプライアンス プロセスの一部として行われる、異なるタイプのレビューがあります。

source: There are formal and informal training methods.
ja: 公式と非公式のトレーニング方法があります。

source: There are four challenges that all companies face with regard to engineering and compliance enforcement:
ja: 技術面やコンプライアンス強制に関連して、全ての企業が直面する4つの挑戦があります。

source: There are great benefits to having an end-to-end compliance process that is simple and well understood within the organization.
ja: 簡潔で、組織内で十分に理解されている一貫したコンプライアンス プロセスを持つことには大きな利点があります。

source: There are intellectual property issues preventing the use or release of the specific component.
ja: 特定のコンポーネントの利用やリリースを阻害する知的財産に関する課題がある。

source: There are license incompatibility issues that cannot be resolved easily.
ja: 容易に解決できない両立しないライセンスがある。

source: There are linkage issues that cannot be resolved easily.
ja: 容易に解決できないリンクに関する課題がある。

source: There are many checkpoints for validating the open source package before it makes its way to the website for customer and/or public consumption.
ja: 顧客や一般向けのウェブサイトで公開する前に、オープン ソース パッケージの正当性を確認するための多くのチェックポイントがあります。

source: There are many tools that can be used together to fulfill the function of dependency checking, including the Source Code Identification Tools listed above, many static analysis tools, reporting tools from build and integration suites, and many home-grown code analysis tools.
ja: 上記のソース コード特定ツール、多くの静的解析ツール、ビルドや統合の報告ツール、自社内製のコード解析ツールなど、依存関係を解析するために一緒に利用されるツールが多くあります。

source: There are no contracts to sign with the software providers (i.e., open source developers or projects).
ja: ソフトウェアの提供者（すなわちオープンソースの開発者やプロジェクト）と調印する契約はありません。

source: There are several benefits to achieving open source compliance.
ja: オープンソースのコンプライアンスを達成する事にはいくつかの利点があります。

source: There are several challenges in maintaining open source compliance, similar to those faced when establishing baseline compliance.
ja: オープンソースのコンプライアンスを維持するには、コンプライアンスの起点確立と同様、いくつかの困難があります。

source: There are several methods to identify open source used in the product:
ja: 製品に利用されるオープン ソースを特定するいくつかの方法があります。

source: There are several reasons that might lead to such a rejection:
ja: そういう却下につながるような理由がいくつかあります。

source: There are several rules governing the OSRB usage form.
ja: OSRB利用フォームに影響するいくつかの規則があります。

source: There are ten key steps in an end-to-end compliance process (Figure 11, next page):
ja: 一貫したコンプライアンス プロセスの10ステップ

source: There are three core recommended practices for source code auditing or scanning:
ja: ソース コード監査やスキャンに関して、3つの推奨プラクティスがあります。

source: There are three main distribution methods for making source code packages available.
ja: ソース コード パッケージを入手可能な状態にする、3つの主な頒布方法があります。

source: There are three main sources for incoming source code:
ja: 入るソース コードには、主に3つの由来があります。

source: There are three major business incentives to distribute open source code: Meeting license obligations, contributing enhancements to an open source project, and creating and contributing code to a new open source project.
ja: オープン ソース コードを頒布することには主に3つのビジネス上の動機があります。ライセンス義務の遵守、オープン ソース プロジェクトの価値を高めるための貢献、新しいオープン ソース プロジェクトに対するコードの貢献です。

source: There are two drawbacks to this method of distribution.
ja: この頒布方法には2つの不利な点があります。

source: There are two primary options for fulfilling documentation obligations requirements:
ja: 文書化義務の要求を満たす2つの主要な選択肢があります。

source: There are two teams involved in achieving compliance: a core team and an extended team, with the latter typically being a superset of the former.
ja: コンプライアンス達成には二つのチームが必要となる。コアチームと拡大チームです。後者は通常、前者を包括するものとなります。

source: There is an open source adage that goes “release early and release often.”
ja: 「早めのリリース、頻繁なリリース“release early and release often.”」というオープン ソースに関する格言があります。

source: There must be a company executive who acts as ongoing compliance champion and who ensures corporate support for open source management functions.
ja: 進行中のコンプライアンスのリーダーとなり、オープンソースの管理機能を企業としてサポートする役員がいなければなりません。
